# 사용자로부터 숫자 하나를 입력 받아, 숫자 목록에 입력 숫자가 있는지
# 이진 검색을 이용하여 찾는 프로그램을 작성하시오
# 숫자목록: [2, 4, 7, 9, 13, 18, 21, 27, 30]
# [구현 조건]
# - 있다면 찾는 숫자가 몇 번째 위치에 있고 몇 번 만에 찾았는지 출력하고
# - 없다면 "찾을 수 없습니다." 몇 번 비교했는지 출력.

######################################################

# while문 쓰고 싶음 찾으면 멈추는 걸로
    # ->> 그런데 인덱스를 참조해야하면 for문을 써야하지 않나
# if문 써야할 것 같음 크면 오른쪽 작으면 왼쪽 가게
# 변수는 A=리스트, mid = 중앙값 , low = 최솟값 , high =최댓값, key = 찾을 것
#

#######################################################

# 리스트 입력받기
    # 한 번에 받아서 쉼표 떼고 공백 떼고 int() 입혀서 리스트에 넣기
    # 그럼 또 for문 써야겠네 
    # 정렬도 해줘야 하네 내가!

A = input("이진 검색 하고 싶은 숫자 쳐. 구분은 쉼표로.: ")
A = A.split(",")
print(A)


for i in range(len(A)):
    A[i].strip()
    A[i]=int(A[i])

print(f"정렬 전: {A}")
A.sort()
print(f"정렬 후: {A}")
#print(A, type(A[0]))

##########################################################
# 저걸 입력받는 게 아니었네 신발
key = int(input("찾을 값 입력하시오: "))


# 찾을 값 입력받아서
# A에서 있나 없나 확인하고 검색을 시작해야함 
    # ->> for문으로 리스트 뒤져서 존재 여부 확인하고 검색 시작
# 여기선 while문?
    # if문으로 A[i] == key 이면 while문 break
    # while문 안에 for문 넣어야 할 것 같음
    # 이렇게 지저분해져도 되는가...?
    # 중앙값 계산해서 (if문)중앙값보다 적으면 왼쪽으로 크면 오른쪽으로
    #
    
    
for i in range(len(A)):
    if A[i] == key:
     # mid = A[(A[0]+A[len(A)])//2]
       mid = ((i+(len(A)-1))//2)
       print(A[mid])
     # low = A[mid+1]
     # high = A[mid-1]
        
        

